Repository: ajwans/sSMTP
Catalog: debian/po/*.po
Languages: fi, vi

source: Automatically overwrite config files?
fi: Korvataanko asetustiedostot automaattisesti?
vi: Tự động ghi đè lên tập tin cấu hình không?

source: The mail configuration file /etc/ssmtp/ssmtp.conf can be automatically updated on each upgrade with the information supplied to the debconf database. If you do not want this to happen (ie/ you want to maintain control of this file yourself) then set this option to have the program never touch this file.
fi: Sähköpostien asetustiedosto /etc/ssmtp/ssmtp.conf voidaan päivittää automaattisesti aina paketin päivityksen yhteydessä käyttäen debconf-tietokantaan annettuja tietoja. Jos et halua näitä päivityksiä (eli haluat hallinnoida tiedostoa käsin), älä valitse tätä vaihtoehtoa.
vi: Tập tin cấu hình thư « /etc/ssmtp/ssmtp.conf » có thể được cập nhật tự động mỗi lần nâng cấp, dùng thông tin được cung cấp vào cơ sở dữ liệu debconf. Nếu bạn không muốn cho phép tiến trình này (tức là bạn muốn tự điều khiển tập tin này) thì hãy lập tùy chọn là không bao giờ cho phép trình này sửa đổi tập tin cấu hình.

source: Mail sent to a local user whose UID is less than 1000 will instead be sent here. This is useful for daemons which mail reports to root and other system UIDs. Make this empty to disable rewriting.
fi: Viestit käyttäjille, joiden käyttäjä-id on pienempi kuin 1000, lähetetään näiden käyttäjien sijaan tälle käyttäjälle. Tästä on hyötyä taustaohjelmien kanssa, jotka lähettävät viestejä pääkäyttäjälle ja muille järjestelmätunnuksille. Jätä kenttä tyhjäksi, jos haluat poistaa uudelleenohjauksen käytöstä.
vi: Mọi thư được gởi cho người dùng địa phương có UID (mã nhận diện người dùng) dưới 1000 sẽ được gởi vào đây thay thế. Tùy chọn này có ích cho trình nền gởi thông báo cho người chủ và ID hệ thống khác. Hãy bỏ trường này rỗng để vô hiệu hóa khả năng ghi lại.

source: Name of your mailhub:
fi: Sähköpostipalvelimen nimi:

source: This sets the host to which mail is delivered. The actual machine name is required; no MX records are consulted. Commonly, mailhosts are named "mail.domain.com".
fi: Tämä määrittää koneen, jolle viestit välitetään. Tämän täytyy olla oikea konenimi, MX-tietueita ei tutkita. Usein postipalvelimien nimi on muotoa ”mail.example.com”.
vi: Giá trị này lập máy sẽ nhận thư. Cần thiết tên máy thật: sẽ không đọc mục ghi MX nào. Thường, máy thư có tên « mail.miền.com ».

source: Remote SMTP port number:
fi: Etä-SMTP-portin numero:

source: If your remote SMTP server listens on a port other than 25 (Standard/RFC) then set it here.
fi: Jos etäpään SMTP-palvelin kuuntelee muuta porttia kuin 25 (standardi), anna se tässä.
vi: Nếu trình phục vụ SMTP ở xa có lắng nghe trên một cổng khác với 25 (chuẩn/RFC) thì hãy lập nó vào đây.

source: ssmtp will use "username@REWRITEDOMAIN" as the default From: address for outgoing mail which contains only a local username.
fi: Jos viestin lähettäjänä on pelkkä paikallinen käyttäjätunnus, ssmtp käyttää lähettäjäosoitteena oletuksena muotoa ”tunnus@NAAMIOVERKKOALUE”.
vi: Trình ssmtp sẽ dùng « username@REWRITEDOMAIN » (tên_người_dùng@GHI_LẠI_MIỀN) là địa chỉ « Từ: » (From:) mặc định cho các thư gởi đi chứa chỉ một tên người dùng địa phương.

source: This is the portion of the address after the '@' sign to be shown on outgoing news and mail messages.
fi: Tämä on ”@”-merkin jälkeinen osoitteen osa, joka näytetään lähtevissä sähköposteissa ja uutisviesteissä.
vi: Đây là phần địa chỉ sau dấu a-còng « @ », để được hiển thị trên các thông điệp tin và thư được gởi đi.

source: Fully qualified hostname:
fi: Täydellinen verkkotunnus:

source: This should specify the real hostname of this machine, and will be sent to the mailhub when delivering mail.
fi: Tämän tulisi määrittää tämän koneen oikea konenimi, joka lähetetään sähköpostipalvelimelle välitettäessä viestejä.
vi: Giá trị này nên ghi rõ tên máy thật của máy này, và sẽ được gởi cho thiết bị trung tâm mạng thư khi phát thư.

source: Allow override of From: line in email header?
fi: Sallitaanko lähettäjäosoitteen muuttaminen sähköpostin otsikkotiedoissa?
vi: Cho phép đè dòng « Từ: » (From:) trong phần đầu thư không?

source: A "positive" response will permit local users to enter any From: line in their messages without it being mangled, and cause ssmtp to rewrite the envelope header with that address. A "negative" response will disallow this, and use only the default address or addresses set in /etc/ssmtp/revaliases.
fi: Jos valitset tämän, paikalliset käyttäjät voivat asettaa lähettäjäosoitteeksi minkä tahansa haluamansa, ja ssmtp muokkaa lähetysotsakkeeseen annetun osoitteen. Jos et valitse tätä, käyttäjät eivät voi muokata lähettäjäosoitetta ja käytössä ovat vain tiedostossa /etc/ssmtp/revaliases asetetut oletusosoitteet.
vi: Trả lời « Có » (yes) tại đây sẽ cho phép người dùng địa phương nhập mọi dòng « Từ: » (From:) vào đây, mà không bị hỏng, và gây ra trình ssmtp ghi lại phần đầu bao dùng địa chỉ này. Còn trả lời « Không » (no) sẽ không cho phép tùy chọn này nên dùng chỉ địa chỉ mặc định hoặc địa chỉ được lập trong « /etc/ssmtp/revaliases ».
